//L001,001,收货:L001上架库区;
拣货策略对象=查表("R101_上架_上架规则表",供应商编码,单据类型编码,"收货")
如果(拣货策略对象 == 空){
	//L001,003,越库:L001越库库区;
	拣货策略对象=查表("R101_上架_上架规则表",供应商编码,单据类型编码,"越库")
}
如果(拣货策略对象 == 空){
	//-,001,-:收货;-,003,-:越库;
	拣货策略对象=查表("R101_上架_上架规则表","-",单据类型编码,"-")
}
如果(拣货策略对象 == 空){
	异常("["+供应商编码+","+单据类型编码+","+存储类型+"/收货/越库"+"]" + "查找" + "R101_上架_上架规则表," + "都未找到数据!")
}
$库位定位分类值="(" + 拣货策略对象.库位定位分类  + ")"
$库位定位分类集合=分解列表($库位定位分类值)

每个($临时库位定位分类 : $库位定位分类集合){
	收货策略库位列表 = 创建列表()
	$库位定位分类集 = 多值查表("R101_基础数据_库位定位分类表",$临时库位定位分类)
	每个($库位定位分类 : $库位定位分类集){
		打印("备货库位定位分类:"+$库位定位分类)
		$区区间集 = 分解列表($库位定位分类.区区间)
		$区区间对象 = 赋值($区区间集,"开始值","结束值")	
		
		$排区间集 = 分解列表($库位定位分类.排区间)
		$排区间对象 = 赋值($排区间集,"开始值","结束值")	
		
		$列区间集 = 分解列表($库位定位分类.列区间)
		$列区间对象 = 赋值($列区间集,"开始值","结束值")	
		
		$层区间集 = 分解列表($库位定位分类.层区间)
		$层区间对象 = 赋值($层区间集,"开始值","结束值")
		
		$库位结果集 = 创建对象()
		$库位结果集 = 数据查询("R101_JAC收货库位数据源", "仓库ID", 仓库ID,"库区",$库位定位分类.库区,
			"区区间开始值",$区区间对象.开始值,"区区间结束值",$区区间对象.结束值,
			"排区间开始值",$排区间对象.开始值,"排区间结束值",$排区间对象.结束值,
			"列区间开始值",$列区间对象.开始值,"列区间结束值",$列区间对象.结束值,
			"层区间开始值",$层区间对象.开始值,"层区间结束值",$层区间对象.结束值)
		如果($库位结果集 == 空){
			异常($库位定位分类集合  + "中未找到收货库位！")
		}
		每个($库位:$库位结果集.库位){
			加入列表(收货策略库位列表, $库位)
		}
	}
}