如果(是否退拣 == "是"){
	单据类型编码 = "FDJ_退拣单"//可以按照供应商扩展使用,目前所有供应商都用FDJ_退拣单
}

拣货策略对象=查表("R101_拣货_拣货规则表",供应商,单据类型编码,数量)
如果(拣货策略对象 == 空){
	拣货策略对象=查表("R101_拣货_拣货规则表","-",单据类型编码,数量)
}
如果(拣货策略对象 == 空){
	异常("[" + 拼接字符串(供应商,单据类型编码,数量) +"]" + "查找" + "R101_拣货_拣货规则表," + "未找到数据!")
}
$库位定位分类值="(" + 拣货策略对象.库位定位分类  + ")"
$库位定位分类集合=分解列表($库位定位分类值)

每个($临时库位定位分类 : $库位定位分类集合){
	备货策略库位列表 = 创建列表()
	$库位定位分类集 = 多值查表("R101_基础数据_库位定位分类表",$临时库位定位分类)
	每个($库位定位分类 : $库位定位分类集){
		打印("备货库位定位分类:"+$库位定位分类)
		$区区间集 = 分解列表($库位定位分类.区区间)
		$区区间对象 = 赋值($区区间集,"开始值","结束值")	
		
		$排区间集 = 分解列表($库位定位分类.排区间)
		$排区间对象 = 赋值($排区间集,"开始值","结束值")	
		
		$列区间集 = 分解列表($库位定位分类.列区间)
		$列区间对象 = 赋值($列区间集,"开始值","结束值")	
		
		$层区间集 = 分解列表($库位定位分类.层区间)
		$层区间对象 = 赋值($层区间集,"开始值","结束值")
		
		$库位结果集 = 创建对象()
		$库位结果集 = 数据查询("R101_JAC备货库位数据源", "仓库ID", 仓库ID,"库区",$库位定位分类.库区,"库位类型",库位类型,
			"区区间开始值",$区区间对象.开始值,"区区间结束值",$区区间对象.结束值,
			"排区间开始值",$排区间对象.开始值,"排区间结束值",$排区间对象.结束值,
			"列区间开始值",$列区间对象.开始值,"列区间结束值",$列区间对象.结束值,
			"层区间开始值",$层区间对象.开始值,"层区间结束值",$层区间对象.结束值)
		如果($库位结果集 == 空){
			异常($库位定位分类集合  + "中未找到备货库存！")
		}
		每个($库位:$库位结果集.库位){
			加入列表(备货策略库位列表, $库位)
		}
	}
}